List ahadythDetails = [
{
"id": 1,
"name": "الحديث الأول",

},
{
"id": 2,
"name": "الحديث الثاني",

},

{
"id": 3,
"name": "الحديث الـثـالـث",

},
{
"id": 4,
"name": "الحديث الـرابع",

},
{
"id": 5,
"name": "الحديث الخامس",

},
{
"id": 6,
"name": "الحديث السادس",

},

{
"id": 7,
"name": "الحديث السابع",

},

{
"id": 8,
"name": "الحديث الثامن",

},
{
"id": 9,
"name": "الحديث التاسع",

},
{
"id": 10,
"name": "الحديث العاشر",

},
{
"id": 11,
"name": "الحديث الحادي عشر",

},
{
"id": 12,
"name": "الحديث الثاني عشر",

},
{
"id": 13,
"name": "الحديث الثالث عشر",

},
{
"id": 14,
"name": "الحديث الرابع عشر",

},
{
"id": 15,
"name": "الحديث الخامس عشر",

},
{
"id": 16,
"name": "الحديث السادس عشر",

},
{
"id": 17,
"name": "الحديث السابع عشر",

},
{
"id": 18,
"name": "الحديث الثامن عشر",

},
{
"id": 19,
"name": "الحديث التاسع عشر",

},
  {
    "id": 20,
    "name": "الحديث العشرون",

  },
  {
    "id": 21,
    "name": "الحديث الحادي والعشرون",

  },
  {
    "id": 22,
    "name": "الحديث الثاني والعشرون",

  },
  {
    "id": 23,
    "name": "الحديث الثالث والعشرون",


  },
  {
    "id": 24,
    "name": "الحديث الرابع والعشرون",


  },
  {
    "id": 25,
    "name": "الحديث الخامس والعشرون",


  },
  {
    "id": 26,
    "name": "الحديث السادس والعشرون",


  },
  {
    "id": 27,
    "name": "الحديث السابع والعشرون",


  },
  {
    "id": 28,
    "name": "الحديث الثامن والعشرون",


  },
  {
    "id": 29,
    "name": "الحديث التاسع والعشرون",


  },
  {
    "id": 30,
    "name": "الحديث الثلا ثــون",


  },
  {
    "id": 31,
    "name": "االحديث الحادي والثلاثون",


  },
  {
    "id": 32,
    "name": "الحديث الثاني والثلاثون",


  },
  {
    "id": 33,
    "name": "الحديث الثالث والثلاثون",


  },
  {
    "id": 34,
    "name": "الحديث الرابع والثلاثون",


  },
  {
    "id": 35,
    "name": "الحديث الخامس والثلاثون",


  },
  {
    "id": 36,
    "name": "الحديث السادس والثلاثون",


  },
  {
    "id": 37,
    "name": "الحديث السابع والثلاثون",


  },
  {
    "id": 38,
    "name": "الحديث الثامن والثلاثون",


  },
  {
    "id": 39,
    "name": "الحديث التاسع والثلاثون",


  },
  {
    "id": 40,
    "name": "الحديث الأربعون",


  },
  {
    "id": 41,
    "name": " الحديث الحادي والأربعون",


  },
  {
    "id": 42,
    "name": "الحديث الثاني والأربعون",


  },
  {
    "id": 43,
    "name": "الحديث الثالث والأربعون",


  },
  {
    "id": 44,
    "name": "الحديث الرابع والأربعون",


  },
  {
    "id": 45,
    "name": "الحديث الخامس والأربعون",


  },
  {
    "id": 46,
    "name": "الحديث السادس والأربعون",


  },
  {
    "id": 47,
    "name": "الحديث السابع والأربعون",


  },
  {
    "id": 48,
    "name": "الحديث الثامن والأربعون",


  },

  {
    "id": 49,
    "name": "الحديث التاسع والأربعون",


  },
  {
    "id": 50,
    "name": "الحديث الخمسون",


  },





];